package com.huagongwuliu.waybillelectronic.constant;

/**
 * @author Li Fuxiang
 * @Description: API接口返回结果状态码
 * @date 2019/10/9
 */
public enum ErrorCode {


    //成功，统一用调用这里，不能再代码中写死0
    SUCCESS(0, "成功"),
    E_11111(1, "查询结果为空"),
    //系统级别错误
    E_10001(10001, "系统出现异常"),
    E_10002(10002, "没有访问接口权限"),
    E_10003(10003, "未找到资源"),
    E_10004(10004, "登录过期"),
    E_10005(10005, "Redis出现异常"),
    E_10006(10006, "解析微信手机号出错" ),

    //具体接口服务级别错误
    E_20001(20001, "该手机号未注册" ),
    E_20002(20002, "密码不正确" ),
    E_20003(20003, "未绑定手机号,请跳转" ),
    E_20004(20004, "验证码错误" ),
    E_20005(20005, "验证码已失效" ),
    E_20006(20006, "操作失败" ),
    E_20007(20007, "请输入验证码" ),
    E_20008(20008, "手机号已注册" ),
    E_20009(20009, "已认证成功，操作无效" ),
    E_20010(20010, "尚未认证" ),
    E_20011(20011, "原密码输入错误" ),
    E_20012(20012, "请输入手机号" ),
    E_20013(20013, "合同生成失败" ),
    E_20014(20014, "申请企业CA失败" ),
    E_20015(20015, "合同签署失败" ),
    E_20016(20016, "合同编号号获取失败" ),
    E_20017(20017, "归档失败" ),
    E_20018(20018, "操作失败，数据不存在" ),
    E_20019(20019, "该单尚未签署合同" ),
    E_20020(20020, "该单已签署合同" ),
    E_20021(20021, "您已盖章请勿重复操作" ),
    E_20022(20022, "运单不存在" ),
    E_20023(20023, "货源已抢空" ),
    E_20024(20024, "当前车辆已上报过货主，5分钟之内不能重复提交" ),
    E_20025(20025, "数据不存在，更新状态失败" ),
    E_20026(20026, "车辆已存在，不能重复添加" ),
    E_20027(20027, "榜单已确认，不能取消运单" ),
    E_20028(20028, "榜单已确认，不能重新上传榜单" ),
    E_20029(20029, "该新闻不存在" ),
    E_20030(20030, "退出成功" ),
    E_20031(20031, "车辆存在报车或货源记录，不能删除" ),
    E_20032(20032, "当前货源已被删除" ),
    E_20033(20033, "当前车源已被删除" ),
    E_20034(20034, "上传资源超出20MB" ),
    E_20035(20035, "用户尚未注册极光IM" ),
    E_20036(20036, "微信二次分享传参出错" ),
    E_20037(20037, "传入参数缺少ID" ),
    E_20038(20038, "参数不可为空" ),
    E_20039(20039, "该车源线路已存在，不能重复添加" ),
    E_20040(20040, "该货源线路已存在，不能重复添加" ),
    E_20041(20041, "内部系统安全码不正确" ),
    E_20042(20042, "您当前只能添加10条该线路" ),
    E_20043(20043, "当前没有开启定位" ),
    E_20044(20044, "jsCode参数不可为空"),
    E_20045(20045, "jsCode参数已失效"),
    E_20046(20046, "您最多添加5条"),
    E_20047(20047, "24小时内只能发送一条"),



    //支付相关的错误码，其他的在上面接着写
    E_50001(5001, "银行卡信息有误" ),
    E_50002(5002, "姓名输入有误" ),
    E_50003(5003, "身份证号码输入有误" ),
    E_50004(5004, "两次输入密码不一致" ),
    E_50005(5005, "支付密码输入错误" ),
    E_50006(5006, "钱包余额不足" ),
    E_50007(5007, "只能绑定自己名下银行卡" ),
    E_50008(5008, "当前银行卡已绑定" ),






    //调用的接口出现错误
    E_30001(30001, "调用微信服务接口出错" ),
    E_30002(30002, "调用第三方短信接口出错" );




    /** 编码 */
    private int code;

    /** 信息 */
    private String msg;

    private ErrorCode(int code, String msg) {
        this.code = code;
        this.msg = msg;
    }


    public int getCode() {
        return code;
    }

    public String getMsg() {
        return msg;
    }
}
